[{"model": "products.category", "pk": 1, "fields": {"name": "skates", "friendly_name": "Skates"}}, {"model": "products.category", "pk": 2, "fields": {"name": "parts", "friendly_name": "Parts"}}, {"model": "products.category", "pk": 3, "fields": {"name": "clothing", "friendly_name": "Clothing"}}, {"model": "products.product", "pk": 1, "fields": {"category": 1, "sku": "16617842", "name": "Trigger Jeff Dalnas", "description": "Trigger is honored to present you the Jeff Dalnas Pro skates.\r\n\r\nThe cuff molds have been improved to protect the buckles more efficiently on this new version of the Trigger Rainbow soft boot skates. The soulframe and boot molds have been modified too to perfectly fit the UFS standard. The liner has been improved once again to reduce the size of the skate and increase the comfort.\r\n\r\nThe Rainbow Jeff Dalnas pro skates will give you the best experience, from beginner to professional, by offering the maximum in response and lightness thanks to his soft boot conception. A slim and precise skate, with his new integrated liner completed by a double densiity insole, and a shock absorber for a smooth riding; all supported by the fast and light Freerocker V2 frame, fitted with high quality wheels in 58mm/90A, and Abec 7 bearings for your best feeling.\r\n\r\nTrigger will give back 30€ by pair of skates sold directly to Jeff Dalnas to support him as a pro rider.\r\n\r\nThe production quantity is limited to 500 pairs.", "clothes_sizes": false, "skate_sizes": true, "price": "310.00", "image_url": null, "image": "Trigger_Skate.webp", "date_added": "2022-08-06T09:27:20.598Z"}}, {"model": "products.product", "pk": 2, "fields": {"category": 1, "sku": "90244800", "name": "Them 909 Brain Dead", "description": "Soul Plates 2.0 :\r\nA. Thickened interior walls for longer lasting.\r\nB. For easier customization, we introduce our new \"Bridge Soul Plate Hardware\". \r\n\r\nTHEM STREET FRAMES\r\nFEATURES:\r\nUFS street skating frame, designed by Kyle Sola and Jon Julio.\r\nLow h-block position, designed for use with flat or anti-rocker wheel setups.\r\nDurable, low-friction material, made from injection-mold glass-filled nylon.\r\nPrecision-milled aluminum frame spacers.\r\nCustom-made steel axles, with asymmetric head - only needs one tool to tighten or loosen.\r\nLow riding height - 30mm from top of frame to middle of axles.\r\n\r\nDimensions:\r\nTwo wheelbase lengths - 250mm or 270mm wheelbase.\r\nFits up-to 58mm wheels for flat-rocker setups.\r\n110mm distance between middle wheels.\r\n\r\nThem Liner - V4", "clothes_sizes": false, "skate_sizes": true, "price": "380.00", "image_url": null, "image": "Them_909_Braindead_y7RHPZM.webp", "date_added": "2022-08-06T09:27:20.598Z"}}, {"model": "products.product", "pk": 3, "fields": {"category": 1, "sku": "32932703", "name": "Them Skates 909 Black", "description": "THEM SKATES presents : \r\n909 COMPLETE ‘22\r\n\r\nWe can finally announce every piece of our THEM 909 SKATES are exclusively designed by us. Fully funded independently. \r\n\r\nEverything from the wheels, hardware, soul plates, frames, boots, cuffs, liners, and  NOW our buckle/strap.\r\n\r\nIt’s a huge accomplishment for us as a skate brand.\r\n\r\n2 new features..\r\n\r\n1. ALL NEW ORIGINAL DESIGN - BUCKLE AND STRAP\r\n\r\n2. Soul Plates 3.0 :\r\n\r\nA. NEW ROYALE GROOVE\r\nB. WIDER POSITIVE AND NEGATIVE SOUL SPACE\r\nC. Thickened interior walls which are longer lasting\r\nD. For easier customization \"Bridge Soul Plate Hardware\"", "clothes_sizes": false, "skate_sizes": true, "price": "290.00", "image_url": null, "image": "Them_909_Black.webp", "date_added": "2022-08-06T09:27:20.598Z"}}, {"model": "products.product", "pk": 4, "fields": {"category": 1, "sku": "47559066", "name": "Them 909 Grey", "description": "THEM SKATES presents : \r\n909 COMPLETE ‘22\r\n\r\nWe can finally announce every piece of our THEM 909 SKATES are exclusively designed by us. Fully funded independently. \r\n\r\nEverything from the wheels, hardware, soul plates, frames, boots, cuffs, liners, and  NOW our buckle/strap.\r\n\r\nIt’s a huge accomplishment for us as a skate brand.\r\n\r\n2 new features..\r\n\r\n1. ALL NEW ORIGINAL DESIGN - BUCKLE AND STRAP\r\n\r\n2. Soul Plates 3.0 :\r\n\r\nA. NEW ROYALE GROOVE\r\nB. WIDER POSITIVE AND NEGATIVE SOUL SPACE\r\nC. Thickened interior walls which are longer lasting\r\nD. For easier customization \"Bridge Soul Plate Hardware\"", "clothes_sizes": false, "skate_sizes": true, "price": "290.00", "image_url": null, "image": "Them_909_Grey.webp", "date_added": "2022-08-06T09:27:20.598Z"}}, {"model": "products.product", "pk": 5, "fields": {"category": 1, "sku": "97207022", "name": "Roces 5th Element White", "description": "A classic boot evoking sweet sensations from our younger selves, it's odd to think the Fifth Element did not make it through rollerblading's implicit core points tally system that was relied upon for much of the new millennium. We couldn't be more pleased to see this boot thriving on the streets again.\r\n\r\n\r\nOne distinct advantage of the Fifth Element over its siblings, the M12 UFS and M12 LO, is its wider shell and toe box. Meaning those with broader feet who love the Roces brand may benefit from choosing the 'chunkier' side to Roces' oeuvre.\r\n\r\nThe two-piece soul kit converts the Fifth Element we remember into a modern UFS skate with ample soul space and a reliable backslide plate.\r\n\r\nThe memory foam liner is comfortable and supports the ankle correctly with a heel lock. The cuff hugs the back part of the leg and creates a solid feeling when landing, even off small curbs.\r\n\r\nThe Roces frame is an unsung hero amongst a growing market of frame products. Simple and to the point, it functions perfectly as an anti rocker and exceptionally as a flat frame. The 60mm 92a wheels included are from the Roces premium range and are only included with the skates.\r\n\r\nNotably, the skates are composed of 47% cornstarch based PU (polyurethane). The packaging is 100% recycled.\r\n\r\nMade in Italy.", "clothes_sizes": false, "skate_sizes": true, "price": "240.00", "image_url": null, "image": "Roces_5th_White.webp", "date_added": "2022-08-06T09:27:20.598Z"}}, {"model": "products.product", "pk": 6, "fields": {"category": 1, "sku": "93128182", "name": "Roces M12 70/30", "description": "The Roces Majestic 12 is one of the most iconic skate of all time.\r\n\r\nThis year Roces celebrates two significant milestones.\r\nFirst, our 70th birthday, and 30 years have passed since our first inline skates catalog.\r\nThe company was founded in 1952 and originally started producing hiking boots. Whit this release, we wanted to celebrate our origins by bringing a numbered limited edition.\r\nThere will be 700 pairs of m12 and 300 pairs of 1992's. Each skate will have its number printed on the liner loop.\r\n\r\nBio-based 🌽 plastic\r\nRecycled liner padding\r\nRecycled lining\r\nThe packaging is recyclable and 99% plastic-free ♻️\r\n\r\nSome of the features:\r\n\r\n• Shell: High Grade Polyurethane, Low cuff\r\n• Closure: Aluminium Memory buckle, Laces\r\n• Boot: Anatomical padding, Slo Memory foam, Anatomical\r\n• Frame: UFS, Glass fiber reinforced polyamide\r\n• Wheels: 2 pcs Roces 58mm 88A, 2 pcs central grinding wheels\r\n• Bearings: ABEC 5\r\n• Spacers: Aluminium\r\n• Axles: Hot Rod S", "clothes_sizes": false, "skate_sizes": true, "price": "240.00", "image_url": null, "image": "Roces_M12_LO_70-30.webp", "date_added": "2022-08-06T09:27:20.598Z"}}, {"model": "products.product", "pk": 7, "fields": {"category": 1, "sku": "89358892", "name": "Razors Shima 1", "description": "SHIMA1 Reissue\r\n\r\n20 years in the making\r\n\r\n2 decades ago Razors released the first Shima Skate what grew into 7 pro skate collaborations with Brian Shima, catapulting both the brand and the man to new heights. The SHIMA1 Reissue pays tribute to the original skate, offering the same iconic soft top lacing and raised liner with SHIMA embroidered across the back. Still based on the Cult boot platform, the skate offers fully replaceable souls, backslide plates, buckles and cuffs. The skate comes fully assembled with Ground Control FLT3 frames and 8 x 60mm wheels with abec 9 bearings.\r\n\r\nFeatures:\r\n\r\nSHIMA1 Soft-top\r\n\r\nCult Boot/Soul/Backslides\r\n\r\nHigh-end Razors Lace-up Liner with SHIMA detailing\r\n\r\nGC FLT3 Frames with improved axle strength\r\n\r\n60mm/90A GC CM Formula Wheels set-up Flat\r\n\r\nAbec 9 Bearings", "clothes_sizes": false, "skate_sizes": true, "price": "260.00", "image_url": null, "image": "Razors_Shima.webp", "date_added": "2022-08-06T09:27:20.598Z"}}, {"model": "products.product", "pk": 8, "fields": {"category": 1, "sku": "80489808", "name": "Razors Cult Black", "description": "Introducing the Cult Black, a black with just a touch of black-charcoal&white accents.  Built around its trusted boot shell, the Cult offers a solid platform for beginner to advanced skaters, right out of the box.  Fully customizable from the buckle and cuffs down to the frame and wheels.\r\n\r\nFeatures:\r\n\r\nBlack Cult Shell with White Highlights\r\nReplaceable Soul Frame & Backslide Plates\r\nReplaceable Cuff with 'buckle stash'\r\nBlack GC FLT3 Frames (UFS Compatible)\r\n57mm/92A GC Lite Wheels\r\nAbec 5 Bearings\r\nClassic, reformed Cult Liner", "clothes_sizes": false, "skate_sizes": true, "price": "175.00", "image_url": null, "image": "Razors_Cult_black.webp", "date_added": "2022-08-06T09:27:20.598Z"}}, {"model": "products.product", "pk": 9, "fields": {"category": 1, "sku": "46819284", "name": "Razors SL Graphite", "description": "The Razors SL is one of those well-loved skates that stands the test of time. We're glad to see the SL isn't going anywhere. The graphite colour is to die for. \r\n\r\nAccentuated by the dark grey embossed vintage Razors logo on the boot, the SL has a classic appeal tugging on any old school heartstrings it can find. Overall, the aesthetics are painfully pleasing. \r\n\r\nThe SL Graphite is fitted with comfortable and streamlined reformed Razors liners, allowing more precise fit options with half sizes 6, 8 & 9. The lightweight, hard-shell boot comes complete with a classic Razors cuff & buckle, GC 57mm wheels, ABEC 9 Bearings and a GC FLT3 frame.\r\n\r\nThe SL is a concrete skate, with plenty of ankle support, shock absorption and decent soul plate for grinding. Beginners will get on just as well as more experienced skaters. The Razors brand sits in a category of skate that everyone will be familiar with and be able to pick up with ease. A quality not to be sniffed at. Grab a pair before they sell out (we know from experience they will all be gone fast). \r\n\r\nFeatures:\r\n\r\nSL boot\r\nReplaceable soul frame with baseless design included replaceable sliders\r\nSL Backslide Plate\r\nGC Featherlite 3 frame\r\nSL heel pad for comfort and impact reduction\r\nRazors liner with 3D-formed tongue and articulated ankle support\r\nVelcro Tongue Stay\r\nGC 57mm/90A wheels and ABEC 9 Bearings", "clothes_sizes": false, "skate_sizes": true, "price": "230.00", "image_url": null, "image": "Razors_SL_Graphite.webp", "date_added": "2022-08-06T09:27:20.598Z"}}, {"model": "products.product", "pk": 10, "fields": {"category": 1, "sku": "52306046", "name": "Razors Shift Camo", "description": "One of the most highly anticipated skates of its time, now a must for those looking for a modern skate with all the historical associations of the Razors brand. \r\n\r\nThis new skate from Razors takes all the elements of their most popular skates; the SL's and the Cult's, mashes them together with the addition of the all-new frame/plate connection system, allowing swift changing of frame set-ups with no fiddly long-winded UFS bolt changing.\r\n\r\nThis new frame/plate connection system is named the IFC (Instant Frame Change). By depressing 2 buttons on the base of the soul, you release the slider, and from that point – the soul, frame, and wheels can disconnect from the boot. Within seconds, you can snap on a fresh setup, all without having to access any of the UFS frame bolts! Very handy indeed.\r\n\r\n\r\nFor the die-hard street skater who wants a very tight connection between the sole and the boot, 2x optional t-nuts can be installed if desired; a connection that will hold up to all the needs of aggressive blading. If you intend to use the skate for cruising (and/or street skating), the t-nuts can be removed and set aside for quick and easy swapping of setups when traveling from spot to spot.\r\n\r\nOn top of its unique features, the Razor Shift Camo is a high-performance aggressive skate. The soulplate is of perfect size and shape and Razors have improved the solidity and energy transfer since the SL by making the base of the boot stiffer. Razors are renowned for their unmatched support, offering a relatively light boot with supported and even flex.\r\n\r\nThe Razors Shift Camo comes with a Camouflage Reign liner that creates a more stable, comfortable, and reliable skate. Out of the box, the Shift Camo is designed to hold up to the serious demands of modern-day street skating. \r\n\r\nFeatures:\r\n\r\n- Slim Shift boot shell\r\n- (IFC) Instant Frame Changing system\r\n- 1-piece slider/backslide with a perfect groove\r\n- Waxed Hockey-Style Laces\r\n- Reign V3 Liner\r\n- Aluminium cuff buckle \r\n- Oversized heel pad\r\n- GC FLT 4 frame\r\n- Abec 9 Bearings", "clothes_sizes": false, "skate_sizes": true, "price": "340.00", "image_url": null, "image": "Razors_Shift_Camo.webp", "date_added": "2022-08-06T09:27:20.598Z"}}, {"model": "products.product", "pk": 11, "fields": {"category": 1, "sku": "88005631", "name": "Mesmer John Bolino", "description": "Pumping away behind Mesmer's beating heart, Billy O'Neil orchestrates an unexpected revival that reverberates deep into the soul rollerblading. The Mesmer Throne. \r\n\r\nThe boot mould is taken from the USD Classic Throne. A skate featured in culture-defining videos and used by some of the best bladers known to humankind (including Billy). Necessary modernizations allow the Mesmer Throne to flourish in Rollerblading's second renaissance. But, what are those modernizations?\r\n\r\nThe one-piece solekit is a brand new design and fits the bottom of the reshaped boot like a glove. Combining decent sole space and a tapered heel keeps the skate slimline whilst practical on various grinding surfaces. The groove is adequate out of the box and placed perfectly to wear your own in. The Bolino Pro skates come with a unique design on the bottom, a charming design aspect. \r\n\r\nThe modified cuff is supportive and adaptive. Perfect for all types of grinding positions and sturdy whilst landing, ensuring the ankles are protected. \r\n\r\nThe re-inforced shell, constructed from PEBAX (polythene and polyamide), updates the skate to 21st century standards and ensures the skate's robustness using standard high performing sports equipment materials.  \r\n\r\nThe Slayer Liner from MyFit offers exceptional comfort and support, utilizing high-density memory foam in combination with microfibre lining. Custom print dual-density soles and hefty shock absorbers round out the skate. \r\n\r\nThe Mesmer Fluid V frames are the same as the Kizer Fluid 5 frames. A staple in the market, sturdy and fast, great for both flat and anti-rocker setups.", "clothes_sizes": false, "skate_sizes": true, "price": "295.00", "image_url": null, "image": "Mesmer_John_Bolino.webp", "date_added": "2022-08-06T09:27:20.598Z"}}, {"model": "products.product", "pk": 12, "fields": {"category": 1, "sku": "18345147", "name": "GAWDS Tim Franken", "description": "The latest edition to the GAWDS family is the new Tim Franken Pro model, featuring the best components available on a classic hard boot silhouette.\r\n\r\nThe skates come as standard with the new MyFit Prime liner, the latest premium model in the Myfit range. The glass fibre reinforced plastic cuff has an upgraded extra strong metal buckle and fast lacing system on the shell.\r\n\r\nThe new soul plate is now injected, lightweight, strong, fast, finished with the perfect anti-rocker setup of the Kizer Fluid IV frames and Tim’s own Pro Gawds wheels and Abec 9 bearings.\r\n\r\nBlack/Black gloss with gold accents. It's an instant classic.", "clothes_sizes": false, "skate_sizes": true, "price": "260.00", "image_url": null, "image": "Gawds_Tim_Franken.webp", "date_added": "2022-08-06T09:27:20.598Z"}}, {"model": "products.product", "pk": 13, "fields": {"category": 1, "sku": "65604434", "name": "GAWDS Franky Morales III", "description": "Rumour has it that Prince, after investing in Nike at the age of 12 and signing Micheal Jordan in 1983, before his passing, also signed Franky Morales and gave him the go-ahead for these Air Jordan XII Retro-inspired Gawds Franky Morales III Pro Skates.\r\n\r\nA story fitting for a beloved rollerblading polymath and lyricist, style transcender, athletic achiever, Instagram influencer and countless gold medalist.\r\n\r\nBut, let’s talk about the skate.\r\n\r\nThe boot uses an internal composite plastic/fibreglass skeleton instead of a shell with a removable liner. An integrated boot/liner brings the foot closer to the skate and, arguably, increases the responsiveness. The fibreglass is supportive and firm whilst also being comfortable through the use of microfibres. Microfibre adds luxury and ventilation to the fitment.\r\n\r\nA smaller nylon cuff collaborates with the fibreglass boot and ensures the overall flexibility of the skate allows for decent grinding positions, particularly in topside and grooved tricks.\r\n\r\nThe Kizer Fluid 4 frame provides a steady base for the skate. The H-Block is wide and amenable, suitable for all ability levels. The frame includes Gawds anti rocker wheels, which are smaller and harder than wheels intended for rolling, helping users achieve grinds with reduced risk of “sticking”.\r\n\r\nPremium Gawds Franky Morales 60mm wheels finish the model. Produced in a world-leading factory, well known to have excellent performance, balanced grip, control, and speed. The maximum wheel size is 60mm, but this model is not compatible with flat setups.", "clothes_sizes": false, "skate_sizes": true, "price": "340.00", "image_url": null, "image": "Gawds_Morales_3.webp", "date_added": "2022-08-06T09:27:20.598Z"}}, {"model": "products.product", "pk": 14, "fields": {"category": 1, "sku": "94617821", "name": "USD Aeon 60 Nick Lomax", "description": "Nick Lomax is a UK legend. I once heard that he skates with his passport in his pocket because he's never sure which country he'll be skating in tomorrow. Nick is living the dream life we all wished for and deserves no less than this pro skate for his dedication, quality and output. \r\n\r\nThe Aeon boot is completely innovative, groundbreaking and offers high performance. The skate breaks every rule in the book and ditched the Universal Frame System (UFS) currently found on pretty much every other aggressive skate on the market.\r\n\r\nTaking away the ability to remove the frame and creating a solid one-piece boot/frame has allowed USD to minimise the amount of hardware (bolts etc) used and also, more crucially, lower the overall centre of gravity. This gives you a lower ride with better control, and an all-around solid feel (try finding a rattle). \r\n\r\nWithout UFS frame mounting bolts you can move the centre two wheels outwards and create extra space in the groove area for grind tricks whilst riding a flat set-up of larger wheels. USD claim that this is the flat best set-up frame ever created. We can say that it is very very good, but we'll leave it up to you to be the judge of that. \r\n\r\nThis version of the skate does not come with the 45 Velcro Strap. Whilst this may be disappointing to some, Nick doesn't use them. Instead, lace loops are strategically placed so that you can lock the laces in a pull tight. This creates the same effect as velcro straps without the extra bulk and fuss. Don't fear. If you love the velcro strap these are available to purchase as an aftermarket item\r\n\r\nHeat-mouldable MyFit dual-fit liners which shape to your foot like a glove, reducing pressure points and increasing comfort. You get a full flat set-up of eight 61mm / 90A wheels loaded with WCD ABEC 7 bearings.", "clothes_sizes": false, "skate_sizes": true, "price": "315.00", "image_url": null, "image": "USD_Aeon_Lomax_22.webp", "date_added": "2022-08-06T09:27:20.598Z"}}, {"model": "products.product", "pk": 15, "fields": {"category": 1, "sku": "20617531", "name": "USD Aeon 60 Bladies", "description": "The modern classic of aggressive street skating. USD took it right back to the drawing board with the design of this skate, shattering all expectations and dismissing the UFS frame system, completely reworking our understanding of an aggressive skate and bringing the design back to basics. The unibody concept defines this unique design, creating the lowest, lightest skate possible with unparalleled energy transfer in every stride. One step back, two steps forward. With a single piece construction the weight is drastically reduced whilst the strength of the boot is immensely increased, you’ll never snap a frame again! The unibody concept allows for the widest H-block split possible, making this the best flat set up skate ever created, keeping you safe from wheel bite on all h-block tricks whilst still riding a full flat set up of fast and long lasting USD 61mm wheels. The skate is completed with the 2018 dual fit MYFIT liners. The stretchy neoprene toes allow for 2 sizes to be catered to with a single liner, giving perfect comfort and support in every session.", "clothes_sizes": false, "skate_sizes": true, "price": "220.00", "image_url": null, "image": "Aeon_Bladies.webp", "date_added": "2022-08-06T09:27:20.598Z"}}, {"model": "products.product", "pk": 16, "fields": {"category": 1, "sku": "67061576", "name": "USD Carbon Free Carlos Bernal", "description": "It must fila-mazing to have another USD pro skate, ask Carlos Bernal!\r\n\r\nThe Catalan shredder is a long-time advocate of the USD Carbon Free boot. The Carbon Free is a one-piece boot (ie the liner is integrated and non-removable). This gives the user a closer fit and greater control.\r\n\r\nThe Carbon Free is aptly named, it’s based on the USD Carbon skate… but the shell is made with a plastic composite (instead of Carbon Fibre) which some riders prefer for it’s shock absorbing qualities and solid landings.\r\n\r\nThe skin on the boot pays tribute to a classic 90’s trainer style and the lining is heat-mouldable (90C in an oven for 10 minutes). Double velcro straps complete the trainer vibes and the slick black seat-belt style top strap is a thing of beauty and a USD first. The removable insole act as a shock absorber; providing a thick foam heel section.\r\n\r\nThe Carbon Free uses the USD Carbon soul kits, as expected. Nice and wide, lightweight and strong with a minimalistic groove.\r\n\r\nWe also noticed a layer of foam added between the soul-plate and the bottom of the boot. A dampener like this is always a welcome addition. Stopping the hard plastic of the soul directly touching the bottom of the boot it a satisfying ‘thump’ to a perfect landing.\r\n\r\nThe USD Carbon Free Carlos Bernal skate comes equipped with Kizer Fluid V frames and flat set up of USD Team 60mm wheels and abec 9 bearings.", "clothes_sizes": false, "skate_sizes": true, "price": "390.00", "image_url": null, "image": "USD_Carbon_Free_Carlos.webp", "date_added": "2022-08-06T09:27:20.598Z"}}, {"model": "products.product", "pk": 17, "fields": {"category": 2, "sku": "57554386", "name": "Intuition V2 Liner", "description": "• Lace Up, Tongue Style Liner\r\n• Low Volume\r\n• Alternative Cuff Wrap Reinforcements\r\n• 7mm Sole with removable heel wedges\r\n• Anti-Microbial Lining\r\n• Height: 17-20cm\r\n• Weight: 300-454g\r\n\r\nThe set includes both left and right\r\n\r\nSKATE V2 liners were developed alongside in-line skaters to improve the fit and maximize the energy transfer in skates with removable liners. The lightweight lace up style liner has a low volume mid-foot and high-density toe box to provide a closer fit and better compatibility with narrow fitting skates, and features ventilation holes in the toe box, and a durable, Velcro adhesive, alternative thickness cuff wrap. This model can be worn out-of-box,", "clothes_sizes": false, "skate_sizes": true, "price": "180.00", "image_url": null, "image": "intuition_v2.webp", "date_added": "2022-08-06T09:57:30.293Z"}}, {"model": "products.product", "pk": 18, "fields": {"category": 2, "sku": "43311829", "name": "50/50 Balance 2 Frame", "description": "Announcing the Balance 2, a classic frame reimagined for today’s skaters. We’ve taken all of the feedback from the community and improved the Balance frame in 5 ways:\r\n\r\n- Bigger split (105mm), max 60mm flat, but same classic groove\r\n\r\n- One sided axles fully compatible with Prime frames\r\n\r\n- Cosmetic upgrades with smaller Juice Bumps and cleaner lines\r\n\r\n- Updated material to be faster and longer lasting\r\n\r\n- No more special frame bolts! Will work with the frame bolts on your skates.\r\n\r\nIn addition, they’re still compatible with Juice Blocks and will be able to ride 65mm wheels when set up antirocker. We’ve kept all the good things and made everything else better.", "clothes_sizes": false, "skate_sizes": false, "price": "60.00", "image_url": null, "image": "5050_balance.webp", "date_added": "2022-08-06T11:06:29.243Z"}}, {"model": "products.product", "pk": 19, "fields": {"category": 2, "sku": "28910080", "name": "50/50 60mm 90a Wheels", "description": "Featuring an exclusive profile designed for the optimal balance of speed and slide. 58mm to fit all sizes of Balance frames as well as most other low profile frames on the market. The 88a hardness provides a ride with the perfect balance of performance and durability.\r\n\r\nSold in packs of 4, but we highly recommended you ride them flat.\r\n\r\nIncludes aluminum bearing spacers for the fastest ride.", "clothes_sizes": false, "skate_sizes": false, "price": "35.00", "image_url": null, "image": "5050_60mm90a.webp", "date_added": "2022-08-06T11:07:26.507Z"}}, {"model": "products.product", "pk": 20, "fields": {"category": 2, "sku": "26564639", "name": "Go Project 62mm Wheel", "description": "We created a brand new 62mm wheel mould exclusive to Go Project. A 62mm wheel with an elliptical profile is not currently being produced anywhere else.\r\n\r\nWe felt the 62's carried their speed well enough without compromising too much on acceleration. We created the urethane a little harder than our previous wheels so they are faster. The small core still allows for enough give in the urethane to create a good 'footprint' (for grip) and shock absorption.\r\n\r\nWe spent the best part of a year testing new materials for the hub. We managed to fully extract the colour pigmentation out of the core this time leaving us with a stronger hub material. We also changed the way the hub is bonded to the urethane 'tyre' so the wheel is now more resistant to de-coring. That said, the wheels have a 1 year warranty against de-coring and core fracturing incase you find an anomaly!\r\n\r\nWith a recent trend towards larger elliptical shaped wheels, the industry has been left with a graveyard of smaller and flatter wheel moulds. We are proud to present to you something entirely new.", "clothes_sizes": false, "skate_sizes": false, "price": "32.00", "image_url": null, "image": "go_project62.webp", "date_added": "2022-08-06T11:08:35.014Z"}}, {"model": "products.product", "pk": 21, "fields": {"category": 2, "sku": "91016932", "name": "Sola Street Frames 60mm Black", "description": "The Solá Equipment Street Frames were born from a dialogue between Kyle Solá and Dominik Wagner regarding the optimal flat-rocker frame, and the reintroduction of a lightweight metal construction into street skating.\r\n\r\nThe feedback-driven development process lead to the prototyping of the first development prototypes in 2015. With the valuable inputs from Dominik Wagner, Joe Atkinson and David Sizemore, prototypes were continuously developed, tested and improved through to the first production in 2018. \r\n\r\nTechnical Specifications\r\n\r\nStreamlined Frame Body\r\nExtruded 6061 T6 hardened aluminum, CNC milled into its final shape\r\nTreated with a surface-hardening anodized finish\r\nLaser engraved with model specifications and specific production lot number\r\nUniversal Frame System (UFS) bolt configuration to fit all corresponding boots\r\nReplaceable H-block System\r\nThe replaceable H-Block is made from a naturally slick and wear resistant injection-molded polymer for all-around street or park skating\r\nRecommended for flat-rockered setups\r\nOne-Way Axles\r\nThe CNC turned, 7000 series aluminum axles screw directly into frame walls, reducing weight and complexity\r\n10mm deep tool cavity helps to keep bolt heads from stripping with regular use\r\nA nylon patch is bonded to the threads, adding friction to resist loosening from vibration\r\nTwo spare axles included in each package", "clothes_sizes": false, "skate_sizes": false, "price": "130.00", "image_url": null, "image": "sola_black_60mm_frames.webp", "date_added": "2022-08-06T11:10:04.012Z"}}, {"model": "products.product", "pk": 22, "fields": {"category": 2, "sku": "39477611", "name": "Sola Street Joe Atkinson high-low 64/60mm", "description": "The Solá Equipment x Joe Atkinson aluminum street skating frames were designed to hold larger, faster rolling wheels in the front or back positions of the frame, while maintaining a low-riding position. Additionally, riders can experiment with different wheel rockering options for a variety of skating experiences.\r\n\r\nNote: Requires clearance for 64mm wheels at front and back of soleplates or boots.\r\n\r\n\r\nTECHNICAL SPECIFICATIONS\r\n\r\nAluminum Frame Body\r\n\r\nExtruded 6061 T6 hardened aluminum, CNC milled into its final shape\r\n\r\nTreated with a surface-hardening anodized finish\r\n\r\nUniversal Frame System (UFS) bolt configuration to fit all corresponding boots\r\n\r\nMax. Wheel Size - 64mm (outside), 60mm (inside). The use of 64mm wheels on the front or back may require soleplate modifications.\r\n\r\n\r\nReplaceable H-block System - V2\r\n\r\nThe replaceable H-Block is made from a naturally slick and wear resistant injection-molded polymer for all-around street or park skating.\r\n\r\nThe V2 h-block design provides increased protection against wheel bite.\r\n\r\nRecommended for flat-rockered setups.", "clothes_sizes": false, "skate_sizes": false, "price": "135.00", "image_url": null, "image": "sola_joe_atkinson.webp", "date_added": "2022-08-06T11:11:30.926Z"}}, {"model": "products.product", "pk": 23, "fields": {"category": 2, "sku": "59184888", "name": "Ground Control Black Hockey Laces", "description": "Groundcontrol Hockey Laces fit all skates. 2 laces in one set.", "clothes_sizes": false, "skate_sizes": false, "price": "6.00", "image_url": null, "image": "ground_control_black_laces.webp", "date_added": "2022-08-06T11:12:37.312Z"}}, {"model": "products.product", "pk": 24, "fields": {"category": 2, "sku": "80789182", "name": "Ground Control FLT 4 White Frame", "description": "The FLT4 utilizes the strength of the Mega frame, the lightweight of the FLT3 frame, and the wheel protection of the HD H-Block.  Comes stock with plastic h-blocks but can be used with our aluminum HD blocks.  Squared-off bottom edges offer increase wheel protection and frame life.  Designed to fit 60mm wheels max\r\n\r\n46mm frame height\r\n41mm frame width\r\n9mm frame wall thickness\r\n110mm middle wheel split\r\n14mm between center of axle and bottom of frame wall\r\nGC 8mm Sickle Bolts w/single tool design\r\nAluminum Frame&Bearing Spacers included\r\nH-block mounts with 2 bolts at top of frame for a secure fit\r\nThe set includes both left and right\r\nAll UFS system frames fit on all UFS system skate boots. No matter the sizing. The distance between the mounting bolts is always the same", "clothes_sizes": false, "skate_sizes": false, "price": "80.00", "image_url": null, "image": "gc_flt_4_white.webp", "date_added": "2022-08-06T11:13:41.960Z"}}, {"model": "products.product", "pk": 25, "fields": {"category": 2, "sku": "98301384", "name": "Ground Control MEGA Frame Set", "description": "Ground Control Mega frame black with Ground Control 64mm/90A wheels..\r\n\r\nAlso available in other colors, just send us a message if you would like a different color.\r\n\r\nThe set includes both left and right", "clothes_sizes": false, "skate_sizes": false, "price": "120.00", "image_url": null, "image": "gc_mega_frame_set.webp", "date_added": "2022-08-06T11:14:39.518Z"}}, {"model": "products.product", "pk": 26, "fields": {"category": 2, "sku": "94151531", "name": "Kaltik Freestyle Black Frame", "description": "Kaltik Freestyle frame is super light and super strong.\r\n\r\nMade from a durable and unique plastic compound in Ireland\r\nProduced in 2 sizes 230mm and 253mm lengt, from the front to the last axle.\r\nThe weight of a 230mm pair of Kaltik freestyle frames including hardware is 500grams.\r\nThe weight of a 253mm pair of Kaltik freestyle frames including hardware is 600grams.\r\nWe recommend the 230mm size frames fit size 5 - 8 uk skates.\r\nWe recommend the 253mm size frames fit size 8 - 12 uk skates.\r\nThe set includes both left and right\r\nThe Kaltik brand is an Ireland based brand established in 2002, they always thrive towards innovation and quality inline skate parts, accessories, and clothing.their team consists of : Roman abrate, Eito yasutoko, Winston wardwell, and stephen swain.", "clothes_sizes": false, "skate_sizes": false, "price": "30.00", "image_url": null, "image": "kaltik_freestyle_black.webp", "date_added": "2022-08-06T11:15:42.002Z"}}, {"model": "products.product", "pk": 27, "fields": {"category": 2, "sku": "70462582", "name": "Reign High Top v3 White Liner", "description": "A few slight variations on the original, the V3 HT offers a raised Achilles dip to allow use with higher cut skate cuffs. A modest increase in ankle and tongue padding offers more support and lengthens liner life. A few cosmetic changes have eliminated any excess materials offering a more appealing look. Similar to its predecessor the HT includes a neoprene toe cap for a more personalized fit, form fitting tongue, rubber heel patch to decrease heel lift, lycra inner-lining, tri-lacing, and handy carry strap. If you are a fan of the V3 liner – this V3 HT is welcome addition to your favorite setup.", "clothes_sizes": false, "skate_sizes": true, "price": "85.00", "image_url": null, "image": "reign_white.webp", "date_added": "2022-08-06T11:16:46.818Z"}}, {"model": "products.product", "pk": 28, "fields": {"category": 2, "sku": "14867108", "name": "Intuition Premium Liner", "description": "After several years of continued development driven by learning from partner brands and consumer feedback, we have refined and combined our best design elements to create our Skate Premium liner, featuring a reinforced tongue and removable cuff for optimal support, energy transfer, and durability.", "clothes_sizes": false, "skate_sizes": true, "price": "210.00", "image_url": null, "image": "intuition-skate-premium-liner.webp", "date_added": "2022-08-06T11:17:43.231Z"}}, {"model": "products.product", "pk": 29, "fields": {"category": 3, "sku": "79885300", "name": "Kaltik Face Beanie Black", "description": "A kaltik beanie with the embroidered face logo.", "clothes_sizes": true, "skate_sizes": false, "price": "17.00", "image_url": null, "image": "Kaltik_face_beanie.webp", "date_added": "2022-08-06T11:27:08.247Z"}}, {"model": "products.product", "pk": 30, "fields": {"category": 3, "sku": "8939309", "name": "Remz Freedom T-Shirt", "description": "Remz is an hardcore aggressive inline skate manufacturers. They made their first skate in the late 90s. Originally from France, Kato the owner moved to the US to build the brand. Right now the top pro skaters for Remz are Jo Zenk and Evert Lubja", "clothes_sizes": true, "skate_sizes": false, "price": "20.00", "image_url": null, "image": "Remz_freedom.webp", "date_added": "2022-08-06T11:28:13.233Z"}}, {"model": "products.product", "pk": 31, "fields": {"category": 3, "sku": "53349431", "name": "Reign Tat Bird T-Shirt", "description": "Reign liners were big in the early 00's and has recently been revamped. It is a part of the Sunshine company and has a great team consisting of Alex Burston, Jo Zenk, Andrew Broom", "clothes_sizes": true, "skate_sizes": false, "price": "20.00", "image_url": null, "image": "reign_tat_shirt.webp", "date_added": "2022-08-06T11:29:15.032Z"}}, {"model": "products.product", "pk": 32, "fields": {"category": 3, "sku": "50030242", "name": "Reign Bird Hat Black", "description": "Reign Bird Snapback Cap\r\n\r\n- 100% Washed Cotton\r\n\r\n- Relaxed Crown, Six-panel\r\n\r\n- Vintage Washed Look\r\n\r\n- Snapback Closure\r\n\r\n- On size fits all", "clothes_sizes": true, "skate_sizes": false, "price": "25.00", "image_url": null, "image": "reign_bird_hat.webp", "date_added": "2022-08-06T11:30:04.699Z"}}, {"model": "products.product", "pk": 33, "fields": {"category": 3, "sku": "79709815", "name": "Blade Club Wax T-Shirt", "description": "A timeless classic. Keep it simple with this all black t-shirt with the iconic Blade Club Logo.", "clothes_sizes": true, "skate_sizes": false, "price": "27.00", "image_url": null, "image": "bc_wax_shirt.webp", "date_added": "2022-08-06T11:30:53.597Z"}}, {"model": "products.product", "pk": 34, "fields": {"category": 3, "sku": "54294003", "name": "Ground Control Crest Hoodie", "description": "Ground Control is a brand known for their aggressive inline skate frames. The brand started in 2002 and is a part of the Sunshine company. Their team is consisting of Alex Burston, Jo Zenk and Nils Jansons", "clothes_sizes": true, "skate_sizes": false, "price": "55.00", "image_url": null, "image": "gc_crest_hoodie.webp", "date_added": "2022-08-06T11:33:08.384Z"}}, {"model": "products.product", "pk": 35, "fields": {"category": 3, "sku": "73764854", "name": "Ground Control Crest Jacket", "description": "Available now and featuring a 100% nylon shell with water proof coating, antique brass eyelets and 6-snap front closure, drawstring closure at bottom opening and elastic cuffs. The GC Crest patch is sewn onto the left chest and an embroidered sickle logo sits just below the neck line on the back. This wind resistant and waterproof jacket is a great companion when out on a night skate or just hanging out with a beer by the bonfire.", "clothes_sizes": true, "skate_sizes": false, "price": "66.00", "image_url": null, "image": "gc_crest_jacket.webp", "date_added": "2022-08-06T11:33:57.459Z"}}, {"model": "products.product", "pk": 36, "fields": {"category": 3, "sku": "67595997", "name": "Ground Control Sickle Beanie", "description": "Dark grey Groundcontrol beanie with white sickle logo.\r\n\r\nKeep your head warm in winter!", "clothes_sizes": true, "skate_sizes": false, "price": "16.00", "image_url": null, "image": "gc-beanie-sichel-grey.webp", "date_added": "2022-08-06T11:34:53.797Z"}}, {"model": "products.product", "pk": 37, "fields": {"category": 3, "sku": "82717744", "name": "50/50 Balance Logo T-Shirt", "description": "50/50 is the oldest brand to make replaceable aggressive inline skate frames. It has been revived in recent years by Lawrence Ingraham.", "clothes_sizes": true, "skate_sizes": false, "price": "18.00", "image_url": null, "image": "5050_logo_shirt.webp", "date_added": "2022-08-06T11:36:23.241Z"}}]